//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2013, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093        **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************
//**********************************************************************
//**********************************************************************
//<AMI_FHDR_START>
//
// Name:  <IT8518Setup.uni>
//
// Description: SIO form string definitions.
//
//<AMI_FHDR_END>
//**********************************************************************
/=#
#include "VFR.uni"
//#include "AmiModulePkg\GenericSio\SioStatucSetup.uni"	

//If customer define the common logical device by themselves, add here.
#string STR_IT8518_SIO_FORM                        #language eng "IT8518 Super IO Configuration"
#string STR_IT8518_SIO_FORM_HELP                   #language eng "System Super IO Chip Parameters."
#string STR_IT8518_SIO_PROMPT                      #language eng "Super IO Chip"
#string STR_IT8518                                 #language eng "IT8518/IT8519"

//
//CIR Settings
//
#string STR_IT8518_CIR_FORM                        #language eng "CIR Controller Configuration"
#string STR_IT8518_CIR_FORM_HELP                   #language eng "Set Parameters of CIR Controller (CIR)"
#string STR_IT8518_CIR_PROMPT                      #language eng "CIR Controller"
#string STR_IT8518_CIR_PROMPT_HELP                 #language eng "Enable or Disable CIR Controller"
#string STR_IT8518_CIR_SETTINGS0                   #language eng "IO=3E0h; IRQ=10;"
#string STR_IT8518_CIR_SETTINGS1                   #language eng "IO=3E0h; IRQ=3,4,5,6,7,9,10,11,12;"
#string STR_IT8518_CIR_CONFIG_VALUE                #language eng "Reset Required"

//RayWu, ADD 2014/07/17 >>
#string STR_SEPARATOR		      #language eng ""
#string STR_EC1_VENDOR		      #language eng "Firmware VENDOR"
#string STR_EC1_VENDOR_VALUE	      #language eng "N/A"
#string STR_EC1_INFO		      #language eng "EC Information"
#string STR_EC1_INFO_VALUE            #language eng "N/A"
#string STR_EC1_VERSION               #language eng "Firmware Version"
#string STR_EC1_VERSION_VALUE         #language eng "N/A"
#string STR_EC1_BUILD_DATE            #language eng "Build Date"
#string STR_EC1_BUILD_DATE_VALUE      #language eng "N/A"

#string STR_AAEON_FEATURES		#language eng "On-Module FEATURES"
#string STR_BATTERY_MANAGEMENT		#language eng "Battery Managerment"
#string STR_BATTERY_MANAGEMENT_HELP		#language eng "Enable to support battery in ACPI OS by I2C_CK,I2C_DAT(B33,B34)"
#string STR_ONE_BATTERY			#language eng "One Battery"

#string STR_EC_HMM_CONFIGURATION		#language eng "On-Module H/W Monitor"
#string STR_EC_HMM_CONFIGURATION_HELP		#language eng "Monitor hardware status"

#string STR_IT851X_CPU_TEMP			#language eng "CPU Temperature(DTS)"

#string STR_G781_TEMP				#language eng "CPU Temperature"
#string STR_G781_TEMP_VALUE			#language eng "N/A"

#string STR_ON_MODULE_CPU_DTS_TEMP		#language eng "CPU Temperature"
#string STR_ON_MODULE_CPU_DTS_TEMP_VALUE	#language eng "N/A"

#string STR_IT851X_SYS_TEMP			#language eng "SYS Temperature"	
#string STR_PC_HEALTH                           #language eng "Pc Health Status"
#string STR_IT851X_SYS_TEMP1			#language eng "CPU Temperature"
#string STR_IT851X_SYS_TEMP1_VALUE		#language eng "N/A"
#string STR_IT851X_SYS_TEMP2			#language eng "System temperature"
#string STR_IT851X_SYS_TEMP2_VALUE		#language eng "N/A"

#string STR_IT851X_FAN1_SPEED                  	#language eng "FAN 1 Speed"
#string STR_IT851X_FAN1_SPEED_VALUE            	#language eng "N/A"
#string STR_IT851X_FAN2_SPEED                  	#language eng "FAN 2 Speed"
#string STR_IT851X_FAN2_SPEED_VALUE            	#language eng "N/A"

#string STR_IT851X_VIN0				#language eng "VACIN"
#string STR_IT851X_VIN0_VALUE			#language eng "N/A"
#string STR_IT851X_VIN1				#language eng "V5"
#string STR_IT851X_VIN1_VALUE			#language eng "N/A"
#string STR_IT851X_VIN2				#language eng "VAC_IN"
#string STR_IT851X_VIN2_VALUE			#language eng "N/A"
#string STR_IT851X_VIN3				#language eng "V5A2"
#string STR_IT851X_VIN3_VALUE			#language eng "N/A"
#string STR_IT851X_VIN4				#language eng "V3.3S"
#string STR_IT851X_VIN4_VALUE			#language eng "N/A"
#string STR_IT851X_VIN5				#language eng "V1.5"
#string STR_IT851X_VIN5_VALUE			#language eng "N/A"
#string STR_IT851X_VIN6				#language eng "V5A"
#string STR_IT851X_VIN6_VALUE			#language eng "N/A"
#string STR_IT851X_VIN7				#language eng "VCORE"
#string STR_IT851X_VIN7_VALUE			#language eng "N/A"
// AAEON Voltage Setup String rule.
#string STR_IT851X_VIN2				#language eng "+12V"
#string STR_IT851X_VIN3				#language eng "+5V"
//>>CSKA_008_Elflo 20150828
#string STR_IT851X_VIN4				#language eng "VMEM"
#string STR_IT851X_VIN5				#language eng "VMEM"
#string STR_IT851X_VIN6				#language eng "VCORE"
#string STR_IT851X_VIN7				#language eng "VGT"
//#string STR_IT851X_VIN4			#language eng "+3.3V"
//#string STR_IT851X_VIN5			#language eng "VMEM"
//#string STR_IT851X_VIN6			#language eng "5VSB"
//#string STR_IT851X_VIN7			#language eng "VCORE"
//<<CSKA_008_Elflo 20150828

#string STR_IT851X_SMARTFAN_FORM                #language eng "Smart Fan Mode Configuration"
#string STR_IT851X_FAN1_CONFIG                  #language eng "System FAN1 Configuration"
#string STR_IT851X_FAN2_CONFIG                  #language eng "System FAN2 Configuration"
#string STR_IT851X_FAN_CONFIG_HELP              #language eng "Smart Fan Configuration"
#string STR_STARTTEMP                 		#language eng "Temperature Of Start"
#string STR_OFFTEMP                   		#language eng "Temperature of Off"
#string STR_STARTPWM                  		#language eng "Start PWM"
#string STR_SLOPE                     		#language eng "Slope (PWM)"
#string STR_PWM0                      		#language eng "0 (PWM)"
#string STR_PWM1                     		#language eng "1 (PWM)"
#string STR_PWM2                      		#language eng "2 (PWM)"
#string STR_PWM4                      		#language eng "4 (PWM)"
#string STR_PWM8                      		#language eng "8 (PWM)"
#string STR_PWM16                     		#language eng "16(PWM)"
#string STR_PWM32                     		#language eng "32(PWM)"
#string STR_PWM64                     		#language eng "64(PWM)"

#string STR_CPU_SMARTFAN			#language eng "CPU Smart Fan control"
#string STR_SYS_SMARTFAN			#language eng "SYS Smart Fan control"

#string STR_FULL_MODE				#language eng "Full Mode"
#string STR_MANUAL_MODE_PWM			#language eng "Manual Mode by PWM"
#string STR_AUTO_MODE_PWM			#language eng "Auto Mode by PWM"

#string STR_MANUAL_SETTING			#language eng "  Manual Setting "
#string STR_MANUAL_HELP_PWM			#language eng "Set Fan at fixed Duty-Cycle Min=0 Max=100 Please input Dec number:"

#string STR_NULL				#language eng "  "
#string STR_NOT_AVAILABLE			#language eng "N/A"

#string STR_IT851X_CPU_SMARTFAN_FORM		#language eng "Fan 1 Mode Configuration"
#string STR_IT851X_SYS_SMARTFAN_FORM		#language eng "Fan 2 Mode Configuration"

//>>CSKA_008_Elflo 20150828
#string STR_PWM_INVERT			#language eng "PWM signal"
#string STR_PWM_INVERT_HELP		#language eng "Select output PWM of inverting or non-uninverting signal"
#string STR_PWM_INVERTING		#language eng "Inverting"
#string STR_PWM_NONINVERTING		#language eng "Non-inverting"
#string STR_MONITOR_THER		#language eng "Monitor Thermal"
#string STR_MONITOR_THER_HELP		#language eng "Select monitor thermal source"
#string STR_IT851X_DTS_TEMP		#language eng "CPU Temperature(DTS)"
#string STR_IT851X_DTS_TEMP1_VALUE	#language eng "N/A"
#string STR_IT851X_SYS1_TEMP		#language eng "Thermal Source 1(T1)"
#string STR_IT851X_SYS2_TEMP		#language eng "Thermal Source 2(T2)"
//<<CSKA_008_Elflo 20150828

//>> CSKA_009_Elflo 20150903
#string STR_IT851XRESTOREACPOWERLOSS		#language eng "Restore AC Power Loss"
#string STR_IT851XRESTOREACPOWERLOSS_HELP	#language eng ""
#string	STR_IT851XRESTOREACPOWERLOSS_LASTSTATE	#language eng "Last State"
#string	STR_IT851XRESTOREACPOWERLOSS_ALWAYSON	#language eng "Always On"
#string	STR_IT851XRESTOREACPOWERLOSS_ALWAYSOFF	#language eng "Always Off"
#string	STR_IT851XRESTOREACPOWERLOSS_BYPASS 	#language eng "Bypass"
//<< CSKA_009_Elflo 20150903

//----------------------------------------------------------------------------
#string STR_EC_BRIGHTNESS_CONFIG_FORM   #language eng "Extended Brightness Configuration"
#string STR_EC_BRIGHTNESS_FORM_HELP	#language eng "Extended Brightness Configuration"
#string STR_BRC_CONTROL                 #language eng "Brightness Controller"
#string STR_BRC_CONTROL_HELP            #language eng "Main Switch for Brightness Function"
#string STR_BRC_MODE                    #language eng "Brightness Mode"
#string STR_BRC_MODE_HELP               #language eng "Brightness Output Mode"
#string STR_BRC_PWM                     #language eng "PWM Mode"
#string STR_BRC_DAC                     #language eng "DAC Mode"
#string STR_BRC_LEVEL                   #language eng "Brightness Level"
#string STR_BRC_LEVEL_HELP              #language eng "Brightness Level"
#string STR_BRC_PWM                     #language eng "PWM Mode"
#string STR_BRC_DAC                     #language eng "DAC Mode"
#string STR_BRC_INVERT                  #language eng "Invert"
#string STR_BRC_INVERT_HELP             #language eng "Invert"
#string STR_BRC_NONINVERT               #language eng "Non Invert"
//----------------------------------------------------------------------------
//#string <string name>                   #language eng ""
//*************************************************************************
//*************************************************************************
//**                                                                     **
//**        (C)Copyright 1985-2013, American Megatrends, Inc.            **
//**                                                                     **
//**                       All Rights Reserved.                          **
//**                                                                     **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093           **
//**                                                                     **
//**                       Phone: (770)-246-8600                         **
//**                                                                     **
//*************************************************************************
//*************************************************************************
